# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [31]:
baby_names[baby_names["Name"]=="Emma"]

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
205      Emma  2005      F    AK     49
418      Emma  2006      F    AK     49
644      Emma  2007      F    AK     41
838      Emma  2008      F    AK     51
...       ...   ...    ...   ...    ...
1013854  Emma  2010      F    WY     23
1013983  Emma  2011      F    WY     43
1014104  Emma  2012      F    WY     40
1014222  Emma  2013      F    WY     30
1014362  Emma  2014      F    WY     32

[566 rows x 5 columns]

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(columns={'Unnamed: 0','Id'},inplace=True)
baby_names.head(10)

       Name  Year Gender State  Count
0      Emma  2004      F    AK     62
1   Madison  2004      F    AK     48
2    Hannah  2004      F    AK     46
3     Grace  2004      F    AK     44
4     Emily  2004      F    AK     41
5   Abigail  2004      F    AK     37
6    Olivia  2004      F    AK     33
7  Isabella  2004      F    AK     30
8    Alyssa  2004      F    AK     29
9    Sophia  2004      F    AK     28

### Step 6. Is there more male or female names in the dataset?

In [10]:
baby_names.groupby('Gender').count()

          Name    Year   State   Count
Gender
F       558846  558846  558846  558846
M       457549  457549  457549  457549

### Step 7. Group the dataset by name and assign to names

In [11]:
names = baby_names.groupby('Name')
names

### Step 8. How many different names exist in the dataset?

In [24]:
names.count()

         Year  Gender  State  Count
Name
Aaban       2       2      2      2
Aadan       4       4      4      4
Aadarsh     1       1      1      1
Aaden     196     196    196    196
Aadhav      1       1      1      1
...       ...     ...    ...    ...
Zyra        7       7      7      7
Zyrah       2       2      2      2
Zyren       1       1      1      1
Zyria      10      10     10     10
Zyriah      9       9      9      9

[17632 rows x 4 columns]

### Step 9. What is the name with most occurrences?

In [28]:
baby_names["Name"][baby_names["Count"].max()]

'Calvin'

### Step 10. How many different names have the least occurrences?

In [29]:
baby_names["Name"][baby_names["Count"].min()]

'Abigail'

### Step 11. What is the median name occurrence?

In [30]:
baby_names["Name"][baby_names["Count"].median()]

'Elizabeth'

### Step 12. What is the standard deviation of names?

In [34]:
names["Count"].std()

Name
Aaban       0.000000
Aadan       0.957427
Aadarsh          NaN
Aaden      21.154974
Aadhav           NaN
             ...
Zyra        1.154701
Zyrah       0.707107
Zyren            NaN
Zyria       0.737865
Zyriah      1.666667
Name: Count, Length: 17632, dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [39]:
names['Count'].describe()

         count       mean        std  min   25%   50%    75%    max
Name
Aaban      2.0   6.000000   0.000000  6.0  6.00   6.0   6.00    6.0
Aadan      4.0   5.750000   0.957427  5.0  5.00   5.5   6.25    7.0
Aadarsh    1.0   5.000000        NaN  5.0  5.00   5.0   5.00    5.0
Aaden    196.0  17.479592  21.154974  5.0  6.00  10.0  20.00  158.0
Aadhav     1.0   6.000000        NaN  6.0  6.00   6.0   6.00    6.0
...        ...        ...        ...  ...   ...   ...    ...    ...
Zyra       7.0   6.000000   1.154701  5.0  5.00   6.0   6.50    8.0
Zyrah      2.0   5.500000   0.707107  5.0  5.25   5.5   5.75    6.0
Zyren      1.0   6.000000        NaN  6.0  6.00   6.0   6.00    6.0
Zyria     10.0   5.900000   0.737865  5.0  5.25   6.0   6.00    7.0
Zyriah     9.0   6.444444   1.666667  5.0  5.00   6.0   7.00   10.0

[17632 rows x 8 columns]